<!DOCTYPE html>
<html>
<head>
    <meta charset=utf-8"/>
    <title>Настоящие антилопы </title>
    <style type="text/css">
        div {
            height: 100%; /* Высота блока */
            overflow: auto; /* Добавляем полосы прокрутки */
            padding-left: 15px; /* Отступ от текста слева *
        }
    </style>

</head>
<body>
<h1></h1>

<h2>Настоящие антилопы</h2>

<div>Настоящие антилопы (лат. Antilopinae) — обширное подсемейство африканских и азиатских полорогих. В среднем они
    крупнее, чем косули.
    Как правило, у них стройные ноги и изящное телосложение. Тем не менее, внутри подсемейства существуют многочисленные
    отличия.
    К родам и видам настоящих антилоп относятся
</div>

</body>
</html>