<?php if (isset($_POST['submit']) && !empty($_POST['date']))

	$zodiacs = [
		[ 
			"name" => "Овен",
			"period" => [ [21, 03], [20, 04] ],
			"divinations" => [
				"Сегодня ты красавчик",
				"Сегодня ты великолепен",
				"Сегодня ты царь",
			],
		],
		[ 
			"name" => "Телец",
			"period" => [ [21, 04], [21, 05] ],
			"divinations" => [
				"Сегодня ты красавчик",
				"Сегодня ты великолепен",
				"Сегодня ты царь",
			],
		],
        [
            "name" => "Близнецы",
            "period" => [ [22, 05], [21, 06] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Рак",
            "period" => [ [22, 07], [22, 07] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Лев",
            "period" => [ [23, 07], [21, 08] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Дева",
            "period" => [ [22, 08], [23, 09] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Весы",
            "period" => [ [24, 09], [23, 10] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Скорпион",
            "period" => [ [24, 10], [22, 11] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Стрелец",
            "period" => [ [23, 10], [22, 11] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Козерог",
            "period" => [ [23, 11], [20, 12] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Водолей",
            "period" => [ [21, 01], [19, 02] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],
        [
            "name" => "Рыбы",
            "period" => [ [20, 02], [20, 03] ],
            "divinations" => [
                "Сегодня ты красавчик",
                "Сегодня ты великолепен",
                "Сегодня ты царь",
            ],
        ],

		/* Дальше вставь зодиаки сам */
	];

	list($day, $month, $year) = explode("-", $_POST['birthday']);
	$timestamp = mktime(0, 0, 0, $month, $day, $year);

	foreach ($zodiacs as $zodiac) {
		if ($timestamp >= mktime(0, 0, 0, $zodiac['period'][0][1], $zodiac['period'][0][0], $year) 
			&& $timestamp <= mktime(0, 0, 0, $zodiac['period'][1][1], $zodiac['period'][1][0], $year)
		) {
			$result = [
				"name" => $zodiac['name'],
				"divination" => $zodiac['divinations'][array_rand($zodiac['divinations'])],
			];
			
			break;
		}
	}

	if (isset($result)) {
		echo "Ваш знак: ", $result['name'], '<br />', 'ПРЕДСКАЗАНИЕ: ', $result['divination'];
	} else {
        echo "Мы не смогли определить ваш знак зодиака! Проверьте верна ли дата.";
    }




